<a href="https://colab.research.google.com/github/DDOYEONN/BigData_Analysis_Test/blob/main/%EC%84%9C%EB%B9%84%EC%8A%A4_%EC%9D%B4%ED%83%88%EC%98%88%EC%B8%A1_%EB%8D%B0%EC%9D%B4%ED%84%B0.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [5]:
import pandas as pd 
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/churn/train.csv')

In [6]:
df.head()

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,6842,15793491,Cherkasova,714,Germany,Male,26,3,119545.48,2,1,0,65482.94,0
1,8963,15607874,Keane,687,France,Male,38,0,144450.58,1,0,1,137276.83,0
2,7047,15737627,Rivero,589,Germany,Female,20,2,121093.29,2,1,0,3529.72,0
3,7503,15697844,Whitehouse,721,Spain,Female,32,10,0.00,1,1,0,136119.96,1
4,3439,15722404,Carpenter,445,France,Female,30,3,0.00,2,1,1,127939.19,0

남성 이탈(Exited)이 가장 많은 국가(Geography)는 어디이고 이탈 인원은 몇명인가?

1. 남성 분류하기 
2. 남성 exited == 1찾기

In [9]:
condition1 = df.loc[(df.Gender == 'Male') & (df.Exited == 1)]

In [ ]:
#value_counts()

In [41]:
condition1.Geography.value_counts().head(1)

Germany    287
Name: Geography, dtype: int64

In [26]:
#sum하면 표안에 값들이 다 합쳐짐 
df.loc[df.Gender == 'Male'].groupby(['Geography']).sum().Exited.sort_values(ascending = False).head(1)

Geography
Germany    287
Name: Exited, dtype: int64